# 花括号代表参数的插入位置
print("{0} love {1}.{2}".format("I", "linka", "39"))
# 关键字参数使用
print("{a} love {b}.{c}".format(a="You", b="linka",c= "39"))
# %格式化字符串ascii代码
print('%c' % 97)
print('%d + %d = %d' % (4, 5, 4 + 5))
# 格式化为科学计数法
print('%e' % (422222222))
# 左边代表打印占的位数，小数点后代表取的位数，d为整数形十进制，f为小数形式，e为科学计数法，默认右对齐，加号表示左对齐
print('%5.2f' % 27.3455555)
print('%.2e' % 28.44442)
print('%10d' % 55)
print('%-10.2d' % 55)
# #为在八进制o，十六进制X 前补'0x'或补'0'，前加0，表示在宽度上用0来填充
print('%#o' % 444)
print('%#X' % 444)
print('%010.2f' % 223.2)
print('%+010.2f' % 223.2)


